app/Controllers/UserController.php

SELECT *
FROM `users`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT *
FROM `users`
WHERE `users`.`id` = '98'
---
    public function getData()
    {
        $user = new Users();
        // $data['allUsers'] = $user->paginate(10);
        // $data['pager'] = $user->pager;
        $data = [
            'allUsers' => $user->paginate(10),
            'pager' => $user->pager,
        ];
        if (!session('user')) {
            return redirect()->to('login');
        }
        if (session('user')['type'] == 'A') {
            return view('Templates/dashboard', $data);
        } else {
            $curentId = 0;
            if (session('user')) {
                $curentId = session('user')['id'];
            }
            $currentUser['currentUser'] = $user->find($curentId);

SELECT *
FROM `users`
WHERE `users`.`id` = '98'
---
    public function edit($id)
    {
        $user = new Users();
        $data['currentUser'] = $user->find($id);

SELECT *
FROM `users`
WHERE `users`.`id` = '98'
---
    public function update()
    {
        $user = new Users();
        $id = $this->request->getPost('id');
        $recordDb = $user->find($id);

UPDATE `users` SET `firstName` = 'Mohmmad', `lastName` = 'Mohmmadi', `email` = 'mohmad@gmail.com', `img` = '1692529828_6915e707dbbe4c5d7f2a.jpg'
WHERE `users`.`id` IN ('98')
SELECT *
FROM `users`
WHERE `users`.`id` = '98'
---
                'email' => $this->request->getPost('email'),
                'img' => $imageName
            ];
            $user->update($id, $userData);
            if($user->find($id)['type']=='A'){
                session()->set('user', $user->find($id));

SELECT *
FROM `users`
WHERE `users`.`id` = '40'
---
    public function editPassword($id)
    {
        $user = new Users();
        $record['currentUser'] = $user->find($id);

SELECT *
FROM `users`
WHERE `users`.`id` = '40'
UPDATE `users` SET `password` = '$2y$10$n8gEVhDaogAeg/EVaAyIlu0PzZzoSY4PavPmByWlzayRgVlph0fOG'
WHERE `users`.`id` IN ('40')
---
    public function updatePassword()
    {
        $user = new Users();
        $id = $this->request->getPost('id');
        $record = $user->find($id);
        $password = $this->request->getVar('currentPass');

        $newPass = password_hash($this->request->getVar('newPass'), PASSWORD_DEFAULT);
        $inputs = $this->validate([
            'currentPass' => 'required|max_length[255]|min_length[6]|alpha_numeric_punct',
            'newPass'  => 'required|max_length[255]|min_length[6]|alpha_numeric_punct',
            'confirmPass' => 'required|max_length[255]|min_length[6]|alpha_numeric_punct',
        ]);
        if (!password_verify($password, $record['password'])) {
            return redirect()->to('editPassword/' . $id)->with('Err', 'Incorrect current password');
        }
        if (!$inputs) {
            return $this->editPassword($id);
        } else {
            $userData = [
                'currentPass' => $this->request->getPost('currentPass'),
                'newPass' => $this->request->getPost('newPass'),
                'confirmPass' => $this->request->getPost('confirmPass'),
            ];

            if ($userData['newPass'] != $userData['confirmPass']) {
                return redirect()->to('editPassword/' . $id)->with('Err', 'The password not match');
            } else {

                $user->update($id, ['password' => $newPass]);

SELECT *
FROM `users`
WHERE `email` = 'admin@gmail.com'
 LIMIT 1
---
    public function logedin()
    {
        $user_table = new Users();

        $inputs = $this->validate([
            'userName' => 'required|valid_email',
            'password' => 'required|max_length[255]|min_length[6]|alpha_numeric_punct',
        ]);
        if (!$inputs) {
            return view('Templates/Login');
        }
        $userName = $this->request->getPost('userName');
        $password = $this->request->getVar('password');
        $result = $user_table->where('email', $userName)->first();